Public Attributes | List of all members
API_SharingInfo Struct Reference
Project Operations
Project sharing parameters. More...
#include <APIdefs_Environment.h>
 Public Attributes
 Int32  | nUsers
Number of registered members of the active project.
 API_UserInfo **  | users
Data of each registered member.
Detailed Description
Project sharing parameters.
See also
ACAPI_Teamwork_ProjectSharing
Remarks
This data gives the information on which users the active team project is opened for. Refer to the API_UserInfo structure for detailed information (what data can be obtained about one team member).